pok3r-custom/pok3r_re_firmware/firmware/library/HT32F1655_56_Driver/src/ht32f1655_56_gpio.c
  /* Check the parameters                                                                                   */
  Assert_Param(IS_AFIO_MODE(AFIO_MODE));

  if (AFIO_PIN & 0x00FF)
  {
    for (index = 0; index < 8; index++)
    {
      if ((AFIO_PIN >> index) & 0x0001)
      {
        Mask |= (0xF << (index * 4));
        PinMode |= (AFIO_MODE << (index * 4));
      }
    }
    HT_AFIO->GPCCFGR[0] =(HT_AFIO->GPCCFGR[0] & ~Mask) | PinMode;
  }

  if (AFIO_PIN & 0xFF00)
  {
    Mask = 0;
    PinMode = 0;

    for (index = 0; index < 8; index++)
    {
      if ((AFIO_PIN >> index) & 0x0100)
      {
        Mask |= (0xF << (index * 4));
        PinMode |= (AFIO_MODE << (index * 4));
      }
    }
    HT_AFIO->GPCCFGR[1] =(HT_AFIO->GPCCFGR[1] & ~Mask) | PinMode;
  }
}

/*********************************************************************************************************//**
 * @brief Configure alternated mode of GPIOD with specified pins.
 * @param AFIO_PIN: This parameter can be any combination of AFIO_PIN_x.
 * @param AFIO_MODE: This parameter can be one of the following values:
          @arg AFIO_MODE_DEFAULT : The default I/O function
          @arg AFIO_MODE_1       : Alternated mode 1
          @arg AFIO_MODE_2       : Alternated mode 2
          @arg AFIO_MODE_3       : Alternated mode 3
          @arg AFIO_MODE_4       : Alternated mode 4
          @arg AFIO_MODE_5       : Alternated mode 5
          @arg AFIO_MODE_6       : Alternated mode 6
          @arg AFIO_MODE_7       : Alternated mode 7
          @arg AFIO_MODE_8       : Alternated mode 8
          @arg AFIO_MODE_9       : Alternated mode 9
          @arg AFIO_MODE_10      : Alternated mode 10
          @arg AFIO_MODE_11      : Alternated mode 11
          @arg AFIO_MODE_12      : Alternated mode 12
          @arg AFIO_MODE_13      : Alternated mode 13
          @arg AFIO_MODE_14      : Alternated mode 14
          @arg AFIO_MODE_15      : Alternated mode 15
 * @retval None
 ************************************************************************************************************/
void AFIO_GPDConfig(u32 AFIO_PIN, AFIO_MODE_Enum AFIO_MODE)
{
  u8 index = 0;
  u32 Mask = 0, PinMode = 0;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_AFIO_MODE(AFIO_MODE));

  if (AFIO_PIN & 0x00FF)
  {
    for (index = 0; index < 8; index++)
    {
      if ((AFIO_PIN >> index) & 0x0001)
      {
        Mask |= (0xF << (index * 4));
        PinMode |= (AFIO_MODE << (index * 4));
      }
    }
    HT_AFIO->GPDCFGR[0] =(HT_AFIO->GPDCFGR[0] & ~Mask) | PinMode;
  }

  if (AFIO_PIN & 0xFF00)
  {
    Mask = 0;
    PinMode = 0;

    for (index = 0; index < 8; index++)
    {
      if ((AFIO_PIN >> index) & 0x0100)
      {
        Mask |= (0xF << (index * 4));
        PinMode |= (AFIO_MODE << (index * 4));
      }
    }
    HT_AFIO->GPDCFGR[1] =(HT_AFIO->GPDCFGR[1] & ~Mask) | PinMode;
  }
}

/*********************************************************************************************************//**
 * @brief Configure alternated mode of GPIOE with specified pins.
 * @param AFIO_PIN: This parameter can be any combination of AFIO_PIN_x.
 * @param AFIO_MODE: This parameter can be one of the following values:
          @arg AFIO_MODE_DEFAULT : The default I/O function
          @arg AFIO_MODE_1       : Alternated mode 1
          @arg AFIO_MODE_2       : Alternated mode 2
          @arg AFIO_MODE_3       : Alternated mode 3
          @arg AFIO_MODE_4       : Alternated mode 4
          @arg AFIO_MODE_5       : Alternated mode 5
          @arg AFIO_MODE_6       : Alternated mode 6
          @arg AFIO_MODE_7       : Alternated mode 7
          @arg AFIO_MODE_8       : Alternated mode 8
          @arg AFIO_MODE_9       : Alternated mode 9
          @arg AFIO_MODE_10      : Alternated mode 10
          @arg AFIO_MODE_11      : Alternated mode 11
          @arg AFIO_MODE_12      : Alternated mode 12
          @arg AFIO_MODE_13      : Alternated mode 13
          @arg AFIO_MODE_14      : Alternated mode 14
          @arg AFIO_MODE_15      : Alternated mode 15
 * @retval None
 ************************************************************************************************************/
void AFIO_GPEConfig(u32 AFIO_PIN, AFIO_MODE_Enum AFIO_MODE)
{
  u8 index = 0;
  u32 Mask = 0, PinMode = 0;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_AFIO_MODE(AFIO_MODE));

  if (AFIO_PIN & 0x00FF)
  {
    for (index = 0; index < 8; index++)
    {
      if ((AFIO_PIN >> index) & 0x0001)
      {
        Mask |= (0xF << (index * 4));
        PinMode |= (AFIO_MODE << (index * 4));
      }
    }
    HT_AFIO->GPECFGR[0] =(HT_AFIO->GPECFGR[0] & ~Mask) | PinMode;
  }

  if (AFIO_PIN & 0xFF00)
  {
    Mask = 0;
    PinMode = 0;

    for (index = 0; index < 8; index++)
    {
      if ((AFIO_PIN >> index) & 0x0100)
      {
        Mask |= (0xF << (index * 4));
        PinMode |= (AFIO_MODE << (index * 4));
      }
    }
    HT_AFIO->GPECFGR[1] =(HT_AFIO->GPECFGR[1] & ~Mask) | PinMode;
  }
}
#endif

/*********************************************************************************************************//**
 * @brief Select the GPIO pin to be used as EXTI channel.
 * @param Channel: Specify the EXTI channel to be configured.
 *        This parameter can be AFIO_EXTI_CH_x.
 * @param Source: Specify the GPIO port to be used for EXTI channel.
 *        This parameter can be AFIO_ESS_Px where x can be A ~ E.
 * @retval None
 ************************************************************************************************************/
void AFIO_EXTISourceConfig(AFIO_EXTI_CH_Enum Channel, AFIO_ESS_Enum Source)
{
  u8 index = 0;
  u32 tmp = 0;
  AFIO_CK_ST;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_AFIO_ESS(Source));
  Assert_Param(IS_AFIO_EXTI_CH(Channel));
  AFIO_CK_ON();
  if (Channel > AFIO_EXTI_CH_7)
  {
    index = 1;
    Channel -= AFIO_EXTI_CH_8;
  }

  tmp = HT_AFIO->ESSR[index];
  tmp &= ~((u32)0x0F << (Channel * 4));
  tmp |= (u32)Source << (Channel * 4);
  HT_AFIO->ESSR[index] = tmp;
  AFIO_CK_OFF();
}
/**
  * @}
  */

/* Private functions ---------------------------------------------------------------------------------------*/
/** @defgroup GPIO_Private_Functions GPIO private functions
  * @{
  */
/*********************************************************************************************************//**
  * @brief Turn on/Turn off specify GPIO clock.
  * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
  * @param Cmd: This parameter can be ENABLE or DISABLE.
  * @retval TRUE or FALSE (TRUE: already turn on, FALSE, Turn on by this call)
  ***********************************************************************************************************/
u32 _GPIO_ClockControl(HT_GPIO_TypeDef* GPIOx, ControlStatus Cmd)
{
  u32 PxENStatus;
  /*--------------------------------------------------------------------------------------------------------*/
  /* ((0x400Bx000 & 0x0000F000) >> 12 ) / 2 + 6 =                                                           */
  /*  (0x0 ~ 0x4) + 16 = 16 ~ 20 for AHBCCR PAEN ~ PEEN bit offset                                          */
  /*--------------------------------------------------------------------------------------------------------*/
  u32 offset = ((((u32)GPIOx) & 0x0000F000) >> 12) / 2 + 6;

  PxENStatus = HT_CKCU->AHBCCR & (1 << offset);

  if (PxENStatus != 0)
  {
    if (Cmd == DISABLE)
    {
      HT_CKCU->AHBCCR &= (~(1 << offset));
    }
    return TRUE;
  }

  HT_CKCU->AHBCCR |= (1 << offset);
  return FALSE;
}

/*********************************************************************************************************//**
  * @brief Turn on/Turn off AFIO clock.
  * @param Cmd: This parameter can be ENABLE or DISABLE.
  * @retval TRUE or FALSE (TRUE: already turn on, FALSE, Turn on by this call)
  ***********************************************************************************************************/
u32 _AFIO_ClockControl(ControlStatus Cmd)
{
  u32 AFIOENStatus;

  AFIOENStatus = HT_CKCU->APBCCR0 & (1 << 14);

  if (AFIOENStatus != 0)
  {
    if (Cmd == DISABLE)
    {
      HT_CKCU->APBCCR0 &= (~(1 << 14));
    }
    return TRUE;
  }

  HT_CKCU->APBCCR0 |= (1 << 14);
  return FALSE;
}
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
